{
    "cogview_api_key": "智谱API KEY",
    "image_base_url": "https://open.bigmodel.cn/api/paas/v4/images/generations",
    "video_base_url": "https://open.bigmodel.cn/api/paas/v4/videos/generations",
    "video_result_url": "https://open.bigmodel.cn/api/paas/v4/async-result/{id}",
    "image_model": "cogview-3-plus",
    "video_model": "cogvideox",
    "enhance_prompt_api_url": "https://api.siliconflow.cn/v1/chat/completions  翻译增强LLM URL - 老金我这里用的Siliconflow 申请地址：https://cloud.siliconflow.cn/i/wdyoipMi",
    "enhance_prompt_api_key": "翻译增强LLM Key",
    "enhance_model": "Qwen/Qwen2.5-7B-Instruct   翻译增强模型，老金我这里用的是Qwen2.5 ",
    "sys_image_gen": "As a Stable Diffusion Prompt expert, you will create prompts from keywords, often from databases like Danbooru. Prompts typically describe the image, use common vocabulary, are ordered by importance, and separated by commas. Avoid using special characters like '-' or '.', but spaces and natural language are acceptable. Avoid word repetition. To emphasize keywords, place them in parentheses to increase their weight. For example, '(flowers)' increases 'flowers' weight by 1.1x, while '(((flowers)))' increases it by 1.331x. Use '(flowers:1.5)' to increase 'flowers' weight by 1.5x. Only increase weights for important tags. Prompts include three parts: prefix (quality tags + style words + effectors) + subject (main focus of the image) + scene (background, environment). The prefix affects image quality. Tags like 'masterpiece', 'best quality' increase image detail. Style words like 'illustration', 'lensflare' define the image style. Effectors like 'bestlighting', 'lensflare', 'depthoffield' affect lighting and depth. The subject is the main focus, like characters or scenes. Detailed subject description ensures rich, detailed images. Increase subject weight for clarity. For characters, describe facial, hair, body, clothing, pose features. The scene describes the environment. Without a scene, the image background is plain and the subject appears too large. Some subjects inherently include scenes (e.g., buildings, landscapes). Environmental words like 'grassy field', 'sunshine', 'river' can enrich the scene. Your task is to design image generation prompts. Please follow these steps: 1. I will send you an image scene. You need to generate a detailed image description. 2. The image description must be in English, output as a Positive Prompt.",
    "sys_video_gen": "Please generate English prompts for video generation models based on the keywords related to video generation in this chat record. Only provide the English prompt content, no need to answer any other content.\nRequirements:\n1. The key components of the prompt include: (camera language + shot angle + lighting) + subject (subject description) + subject movement + scene (scene description) + (atmosphere)\n2. Do not include Chinese in the prompt, use only English.",
    "storage_path": "/root/chatgpt-on-wechat/plugins/CogView2Cow/image_video",
    "cleanup_days": 3,
    "cleanup_check_interval_minutes": 1440,
    "image_command": "智谱画图",
    "video_command": "智谱视频",
    "query_command": "查询进度",
    "daily_usage_limit": 5
}
